# Запуск dpdk-testpmd

```sh
sudo ./dpdk-testpmd -l 1,2,3 --socket-mem 1024 -n 4 -- -i
```

```sh
sudo ./dpdk-testpmd -l 1,2,3 --socket-mem 1024 -n 4 --port-topology=chained -- -i
```

Параметры командной строки:

1. -l 1,2,3:

    - Указывает, что dpdk-testpmd будет использовать логические ядра 1, 2 и 3 для обработки пакетов.

2. --socket-mem 1024:

    - Задает размер памяти в мегабайтах для каждого NUMA сокета. В данном случае, каждому сокету выделяется по 1024 МБ памяти.

3. -n 4:

    - Указывает количество каналов памяти. Обычно соответствует количеству DIMM модулей памяти.

4. -- -i:

    - После -- следуют параметры, передаваемые непосредственно приложению dpdk-testpmd. В данном случае, -i означает запуск в интерактивном режиме.

# Интерактивный режим

## Основные команды в интерактивном режиме:

Запуск всех портов:
```sh
testpmd> port start all
```

Установка режима форвардинга по MAC-адресу:
```sh
testpmd> set fwd mac
```

Запуск передачи пакетов:
```sh
testpmd> start
```

Проверка статистики портов:
```sh
testpmd> show port stats all
```